<template>
  <div class="d2-page-cover">
    <ve-histogram
      :data="chartData"
      width="80vw"
      height="60vh"
      :settings="chartSettings"
      :data-zoom="dataZoom"
      :toolbox="toolbox"
      :extend="extend"
    ></ve-histogram>
    <slot name="footer" />
  </div>
</template>

<script>
export default {
  data() {
    this.chartSettings = {
      metrics: ["现有数量", "最低存储"],
      dimension: ["名称"]
    };
    this.dataZoom = [
      {
        type: "slider",
        start: 0,
        end: 20
      }
    ];
    this.toolbox = {
      feature: {
        magicType: { type: ["line", "bar"] },
        saveAsImage: {}
      }
    };
    this.extend = {
      "xAxis.0.axisLabel.rotate": 50
    };
    return {
      chartData: {
        columns: ["名称", "现有数量", "最低存储", "下单率"],
        rows: [
          { 名称: "30*30型材", 现有数量: 1393, 最低存储: 1093, 下单率: 0.32 },
          { 名称: "40*30型材", 现有数量: 3530, 最低存储: 3230, 下单率: 0.26 },
          { 名称: "50*30型材", 现有数量: 2923, 最低存储: 2623, 下单率: 0.76 },
          { 名称: "60*30型材", 现有数量: 1723, 最低存储: 1423, 下单率: 0.49 },
          { 名称: "70*30型材", 现有数量: 3792, 最低存储: 3492, 下单率: 0.323 },
          { 名称: "80*30型材", 现有数量: 4593, 最低存储: 4293, 下单率: 0.78 },
          { 名称: "90*40型材", 现有数量: 31530, 最低存储: 3230, 下单率: 0.26 },
          { 名称: "50*40型材", 现有数量: 29223, 最低存储: 2623, 下单率: 0.76 },
          { 名称: "60*40型材", 现有数量: 17243, 最低存储: 1423, 下单率: 0.49 },
          { 名称: "70*40型材", 现有数量: 37927, 最低存储: 3492, 下单率: 0.323 },
          { 名称: "80*40型材", 现有数量: 74593, 最低存储: 4293, 下单率: 0.78 },
          { 名称: "40*50型材", 现有数量: 34530, 最低存储: 3230, 下单率: 0.26 },
          { 名称: "50*50型材", 现有数量: 29523, 最低存储: 2623, 下单率: 0.76 },
          { 名称: "60*50型材", 现有数量: 17243, 最低存储: 1423, 下单率: 0.49 },
          { 名称: "70*50型材", 现有数量: 37972, 最低存储: 3492, 下单率: 0.323 },
          { 名称: "80*50型材", 现有数量: 45793, 最低存储: 4293, 下单率: 0.78 },
          { 名称: "40*60型材", 现有数量: 35380, 最低存储: 3230, 下单率: 0.26 },
          { 名称: "50*60型材", 现有数量: 29253, 最低存储: 2623, 下单率: 0.76 },
          { 名称: "60*60型材", 现有数量: 17283, 最低存储: 1423, 下单率: 0.49 },
          { 名称: "70*60型材", 现有数量: 31792, 最低存储: 3492, 下单率: 0.323 },
          { 名称: "80*60型材", 现有数量: 45193, 最低存储: 4293, 下单率: 0.78 },
          { 名称: "40*70型材", 现有数量: 35310, 最低存储: 3230, 下单率: 0.26 },
          { 名称: "50*70型材", 现有数量: 29223, 最低存储: 2623, 下单率: 0.76 },
          { 名称: "60*70型材", 现有数量: 17223, 最低存储: 1423, 下单率: 0.49 },
          { 名称: "70*70型材", 现有数量: 37922, 最低存储: 3492, 下单率: 0.323 },
          { 名称: "80*70型材", 现有数量: 4593, 最低存储: 4293, 下单率: 0.78 },
          { 名称: "40*80型材", 现有数量: 33530, 最低存储: 3230, 下单率: 0.26 },
          { 名称: "50*80型材", 现有数量: 29323, 最低存储: 2623, 下单率: 0.76 },
          { 名称: "60*80型材", 现有数量: 17223, 最低存储: 1423, 下单率: 0.49 },
          { 名称: "70*80型材", 现有数量: 37942, 最低存储: 3492, 下单率: 0.323 },
          { 名称: "80*80型材", 现有数量: 45931, 最低存储: 4293, 下单率: 0.78 }
        ]
      }
    };
  }
};
</script>
<style lang="scss" scoped>
.d2-page-cover {
  @extend %full;
  @extend %unable-select;
  display: flex;
  flex-flow: column nowrap;
  justify-content: center;
  align-items: center;
  .d2-page-cover__logo {
    img {
      width: 200px;
    }
  }
  .d2-page-cover__title {
    margin: 0px;
    margin-bottom: 20px;
    font-weight: bold;
    color: $color-text-main;
  }
  .d2-page-cover__sub-title {
    margin: 0px;
    margin-bottom: 5px;
    color: $color-text-normal;
  }
  .d2-page-cover__build-time {
    margin: 0px;
    margin-bottom: 10px;
    font-size: 12px;
    color: $color-text-placehoder;
  }
}
</style>
